{"name":"Yu Gao","headerTaglineOne":"Hello, Yu Gao here","headerTaglineTwo":"software developer.","headerTaglineThree":"","headerTaglineFour":"","showCursor":false,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/yugao-sde"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/yugao2077/"},{"id":"5","title":"Email","link":"mailto:yugao2077@gmail.com"}],"projects":[{"id":"1","title":"Game Station","description":"Web Development","imageSrc":"https://i.ibb.co/h23hSgf/gamestation.jpg","url":"https://gamestation.herokuapp.com/"},{"id":"8e4375fb-0436-42bd-be4f-bb9c2b66d4c0","title":"Ticket Master","description":"Web Development","imageSrc":"https://i.ibb.co/q1cxCN1/QQ-20230916232733.jpg","url":"https://github.com/yugao-sde/EventEyes"}],"services":[{"id":"1","title":"Workday","description":" I led multiple backend and frontend testing efforts across multiple teams and developed multiple performance-enhancing toolkits by Python to analyze and enhance pipeline and test framework performance. These contributions have improved software quality, testing efficiency, and end-user satisfaction."},{"id":"2","title":"SAP","description":"I enhanced SAP Analytics Cloud key features using JavaScript/TypeScript and resolved critical customer issues swiftly with proactive strategies, also achieved a top-ranking 97% test coverage through automation and Jenkins CI/CD pipeline development."}],"aboutpara":"Greetings! I'm Yu Gao, your friendly coding enthusiast 🚀. With a Master's in Computer Science and a Bachelor's in Software Engineering, I'm like a digital wizard on a quest for innovation 🧙‍♂️.\nThroughout my industry experience, I embarked on epic journeys filled with bug-battling and heroic coding endeavors. I thrived in collaboration with cross-functional teams and skillfully harnessed a multitude of frameworks.  I possess mastery over a diverse spectrum of languages and tools, including JS/TS, Java, and SQL, which is why Workday and SAP summoned me to their aid.\nI've been passionate about painting 🎨 since my elementary school days, and this artistic journey has sharpened my patience and creative skills. Beyond art, I bring this heightened sensitivity to detail into UI-related work. It's second nature for me to spot even the slightest 1px miss-position issue, ensuring a polished and perfect user interface. In addition, I'm a pet parent with two dogs 🐶 and two cats 🐱, adding an extra layer of warmth and companionship to my days 🐾.","resume":{"tagline":"👨‍💻  I'm a software developer (in most of time).","description":"I have delivered world-class user experiences to millions of people. Well-versed with JavaScript, Java, and most of the FE/BE/Testing frameworks.","experiences":[{"id":"1","dates":"May 2023 - Present","type":"Internship","position":"Software Developer in Test at Workday","bullets":"Led the backend testing of the dataset of Analytics reports using REST APIs, Python and Robot, then promptly found and resolved two data security issues.Spearheaded the frontend feature integration testing using TypeScript and Selenium, resulting in the identification of infra render and logic issues, ensuring a seamless and bug-free user experience for end-users.Developed a comprehensive toolkit using Python and JavaScript that extracted test suites' running time from the Bamboo pipeline XML results, and implemented an efficient O(N) time algorithm within the script to greatly enhanced testing performance, enabling better monitoring and Continuous Integration.Collaborating with multiple teams to analyze, plan, and migrate end-to-end tests from Robot to TypeScript, resulting in improved efficiency and streamlined processes, saving an average of 20s for each test case"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"September 2022 - April 2023","type":"Internship","position":"Software Developer at SAP","bullets":"Took ownership of enhancing key features for SAP Analytics Cloud, including filtering, bookmarking, and PDF exporting, utilizing a tech stack consisting of JavaScript, TypeScript, JSON, and CSS, resulting in significant performance improvements and heightened client satisfaction.Defended against top priority customer issues from leading brands by implementing proactive strategies including Remote Debugging and Ask Mode Testing, resulting in swift identification and resolution of issues within 3 days (avg 5 days) and a high level of customer satisfaction.Demonstrated expertise in software quality assurance by developing, and debugging highly effective automation tests and CI/CD pipelines in Jasmine and Jenkins, achieving test coverage of over 97% (rank1 of 10 teams).Championed agile software development principles by collaborating with cross-functional teams and leveraging online tools including Gerrit, GitHub, JIRA, and Confluence, resulting in a streamlined and highly efficient workflow"}],"education":{"universityName":"Northeastern University","universityDate":"2021-2023","universityPara":"Master of Science in Computer Science, GPA 3.8/4.0"},"languages":["Javascript/Typescript","Java","Python","SQL"],"frameworks":["React, Redux","NodeJS, ExpressJS, SpringBoot","MySQL, MongoDB, Mongoose","RestAPIs, Jest, JUnit, Selenium","Jenkins, Bamboo, Docker, AWS"],"others":["JIRA","Git"]}}